src/testsuite_old/sysbench/results/oltp_point_select.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 334802.14 qps: 334802.14 (r/w/o: 334802.14/0.00/0.00) lat (ms,95%): 0.32 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 343844.77 qps: 343844.92 (r/w/o: 343844.92/0.00/0.00) lat (ms,95%): 0.33 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            20239412
        write:                           0
        other:                           0
        total:                           20239412
    transactions:                        20239412 (337227.22 per sec.)
    queries:                             20239412 (337227.22 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      337227.2216
    time elapsed:                        60.0189s
    total number of events:              20239412

Latency (ms):
         min:                                    0.07
         avg:                                    0.19
         max:                                   59.61
         95th percentile:                        0.33
         sum:                              3820008.98

Threads fairness:
    events (avg/stddev):           316233.6875/32226.74
    execution time (avg/stddev):   59.6876/0.06

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 378972.52 qps: 378972.52 (r/w/o: 378972.52/0.00/0.00) lat (ms,95%): 0.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 386008.98 qps: 386008.98 (r/w/o: 386008.98/0.00/0.00) lat (ms,95%): 0.30 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            22944919
        write:                           0
        other:                           0
        total:                           22944919
    transactions:                        22944920 (382396.25 per sec.)
    queries:                             22944919 (382396.23 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      382396.2516
    time elapsed:                        60.0041s
    total number of events:              22944920

Latency (ms):
         min:                                    0.06
         avg:                                    0.17
         max:                                   30.73
         95th percentile:                        0.30
         sum:                              3817031.76

Threads fairness:
    events (avg/stddev):           358507.5469/81862.45
    execution time (avg/stddev):   59.6411/0.13